taurus.yml
execution:
  - executor: molotov
    scenario: backend-load
    concurrency: 50
    ramp-up: 1m
    hold-for: 10s

scenarios:
  backend-load:
    script: api_loadtest.py
    extensions:
      - db_loadtest.py

reporting:
  - module: console
  - module: final-stats
  - module: junit-xml
    filename: results.xml

settings:
  artifacts-dir: artifacts/%Y-%m-%d_%H-%M-%S
  check-interval: 1s